Autodesk.Revit.DB.EdgeArrayArray
An array of edge arrays.

Autodesk.Revit.DB.EdgeArrayArray.Insert(Autodesk.Revit.DB.EdgeArray,System.Int32)
System.Int32
Insert the specified edge array into the array.
item: The edge array to be inserted into the array.
index: The edge array will be inserted before this index.
Returns: Returns whether the edge array was inserted into the array.

Autodesk.Revit.DB.EdgeArrayArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.EdgeArrayArray.ReverseIterator
Autodesk.Revit.DB.EdgeArrayArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.EdgeArrayArray.ForwardIterator
Autodesk.Revit.DB.EdgeArrayArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.EdgeArrayArray.Append(Autodesk.Revit.DB.EdgeArray)
void
Add the edge array to the end of the array.
item: The edge array to be added.

Autodesk.Revit.DB.EdgeArrayArray.Clear
void
Removes every edge array from the array, rendering it empty.

Autodesk.Revit.DB.EdgeArrayArray.Size
System.Int32
get
Returns the number of edge arrays that are in the array.

Autodesk.Revit.DB.EdgeArrayArray.Item(System.Int32)
System.Object
Gets or sets an edge array at a specified index within the array.
index: The index of the edge array to be set or retrieved.
Returns: Returns the edge array at the specified index.

Autodesk.Revit.DB.EdgeArrayArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.